Revit 2026 API

# RepeatingReferenceSource Properties

---

The RepeatingReferenceSource type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionCount | The dimension count of the repeating reference array. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RepeatingReferenceSource Class

Autodesk.Revit.DB Namespace